app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Snow"], ["updated_at", "2016-10-22 19:14:24.146359"], ["id", 4]]